
*** Dumping AST Record Layout
         0 | struct __NSConstantString_tag
         0 |   const int * isa
         8 |   int flags
        16 |   const char * str
        24 |   long length
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct __crt_locale_data_public
         0 |   const unsigned short * _locale_pctype
         8 |   int _locale_mb_cur_max
        12 |   unsigned int _locale_lc_codepage
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct __crt_locale_pointers
         0 |   struct __crt_locale_data * locinfo
         8 |   struct __crt_multibyte_data * mbcinfo
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct _Mbstatet
         0 |   unsigned long _Wchar
         4 |   unsigned short _Byte
         6 |   unsigned short _State
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct GLFWvidmode
         0 |   int width
         4 |   int height
         8 |   int redBits
        12 |   int greenBits
        16 |   int blueBits
        20 |   int refreshRate
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct GLFWgammaramp
         0 |   unsigned short * red
         8 |   unsigned short * green
        16 |   unsigned short * blue
        24 |   unsigned int size
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct GLFWimage
         0 |   int width
         4 |   int height
         8 |   unsigned char * pixels
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct GLFWgamepadstate
         0 |   unsigned char[15] buttons
        16 |   float[6] axes
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | struct GLFWallocator
         0 |   GLFWallocatefun allocate
         8 |   GLFWreallocatefun reallocate
        16 |   GLFWdeallocatefun deallocate
        24 |   void * user
           | [sizeof=32, align=8]