
*** Dumping AST Record Layout
         0 | struct __NSConstantString_tag
         0 |   const int * isa
         8 |   int flags
        16 |   const char * str
        24 |   long length
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisShortString_
         0 |   const char * data
         8 |   ZyanU8 size
           | [sizeof=9, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisRegisterContext_
         0 |   ZyanU64[266] values
           | [sizeof=2128, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperandReg_
         0 |   ZydisRegister value
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperandMemDisp_
         0 |   ZyanBool has_displacement
         8 |   ZyanI64 value
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperandMem_
         0 |   ZydisMemoryOperandType type
         4 |   ZydisRegister segment
         8 |   ZydisRegister base
        12 |   ZydisRegister index
        16 |   ZyanU8 scale
        24 |   struct ZydisDecodedOperandMemDisp_ disp
        24 |     ZyanBool has_displacement
        32 |     ZyanI64 value
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperandPtr_
         0 |   ZyanU16 segment
         4 |   ZyanU32 offset
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | union ZydisDecodedOperandImmValue_
         0 |   ZyanU64 u
         0 |   ZyanI64 s
           | [sizeof=8, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperandImm_
         0 |   ZyanBool is_signed
         1 |   ZyanBool is_relative
         8 |   union ZydisDecodedOperandImmValue_ value
         8 |     ZyanU64 u
         8 |     ZyanI64 s
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | union ZydisDecodedOperand_::(unnamed at amalgamated-dist/Zydis.h:5338:5)
         0 |   struct ZydisDecodedOperandReg_ reg
         0 |     ZydisRegister value
         0 |   struct ZydisDecodedOperandMem_ mem
         0 |     ZydisMemoryOperandType type
         4 |     ZydisRegister segment
         8 |     ZydisRegister base
        12 |     ZydisRegister index
        16 |     ZyanU8 scale
        24 |     struct ZydisDecodedOperandMemDisp_ disp
        24 |       ZyanBool has_displacement
        32 |       ZyanI64 value
         0 |   struct ZydisDecodedOperandPtr_ ptr
         0 |     ZyanU16 segment
         4 |     ZyanU32 offset
         0 |   struct ZydisDecodedOperandImm_ imm
         0 |     ZyanBool is_signed
         1 |     ZyanBool is_relative
         8 |     union ZydisDecodedOperandImmValue_ value
         8 |       ZyanU64 u
         8 |       ZyanI64 s
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedOperand_
         0 |   ZyanU8 id
         4 |   ZydisOperandVisibility visibility
         8 |   ZydisOperandActions actions
        12 |   ZydisOperandEncoding encoding
        16 |   ZyanU16 size
        20 |   ZydisElementType element_type
        24 |   ZydisElementSize element_size
        26 |   ZyanU16 element_count
        28 |   ZydisOperandAttributes attributes
        32 |   ZydisOperandType type
        40 |   union ZydisDecodedOperand_::(anonymous at amalgamated-dist/Zydis.h:5338:5) 
        40 |     struct ZydisDecodedOperandReg_ reg
        40 |       ZydisRegister value
        40 |     struct ZydisDecodedOperandMem_ mem
        40 |       ZydisMemoryOperandType type
        44 |       ZydisRegister segment
        48 |       ZydisRegister base
        52 |       ZydisRegister index
        56 |       ZyanU8 scale
        64 |       struct ZydisDecodedOperandMemDisp_ disp
        64 |         ZyanBool has_displacement
        72 |         ZyanI64 value
        40 |     struct ZydisDecodedOperandPtr_ ptr
        40 |       ZyanU16 segment
        44 |       ZyanU32 offset
        40 |     struct ZydisDecodedOperandImm_ imm
        40 |       ZyanBool is_signed
        41 |       ZyanBool is_relative
        48 |       union ZydisDecodedOperandImmValue_ value
        48 |         ZyanU64 u
        48 |         ZyanI64 s
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisAccessedFlags_
         0 |   ZydisAccessedFlagsMask tested
         4 |   ZydisAccessedFlagsMask modified
         8 |   ZydisAccessedFlagsMask set_0
        12 |   ZydisAccessedFlagsMask set_1
        16 |   ZydisAccessedFlagsMask undefined
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawRex_
         0 |   ZyanU8 W
         1 |   ZyanU8 R
         2 |   ZyanU8 X
         3 |   ZyanU8 B
         4 |   ZyanU8 offset
           | [sizeof=5, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawXop_
         0 |   ZyanU8 R
         1 |   ZyanU8 X
         2 |   ZyanU8 B
         3 |   ZyanU8 m_mmmm
         4 |   ZyanU8 W
         5 |   ZyanU8 vvvv
         6 |   ZyanU8 L
         7 |   ZyanU8 pp
         8 |   ZyanU8 offset
           | [sizeof=9, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawVex_
         0 |   ZyanU8 R
         1 |   ZyanU8 X
         2 |   ZyanU8 B
         3 |   ZyanU8 m_mmmm
         4 |   ZyanU8 W
         5 |   ZyanU8 vvvv
         6 |   ZyanU8 L
         7 |   ZyanU8 pp
         8 |   ZyanU8 offset
         9 |   ZyanU8 size
           | [sizeof=10, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawEvex
         0 |   ZyanU8 R
         1 |   ZyanU8 X
         2 |   ZyanU8 B
         3 |   ZyanU8 R2
         4 |   ZyanU8 mmm
         5 |   ZyanU8 W
         6 |   ZyanU8 vvvv
         7 |   ZyanU8 pp
         8 |   ZyanU8 z
         9 |   ZyanU8 L2
        10 |   ZyanU8 L
        11 |   ZyanU8 b
        12 |   ZyanU8 V2
        13 |   ZyanU8 aaa
        14 |   ZyanU8 offset
           | [sizeof=15, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawMvex_
         0 |   ZyanU8 R
         1 |   ZyanU8 X
         2 |   ZyanU8 B
         3 |   ZyanU8 R2
         4 |   ZyanU8 mmmm
         5 |   ZyanU8 W
         6 |   ZyanU8 vvvv
         7 |   ZyanU8 pp
         8 |   ZyanU8 E
         9 |   ZyanU8 SSS
        10 |   ZyanU8 V2
        11 |   ZyanU8 kkk
        12 |   ZyanU8 offset
           | [sizeof=13, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvxMask_
         0 |   ZydisMaskMode mode
         4 |   ZydisRegister reg
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvxBroadcast_
         0 |   ZyanBool is_static
         4 |   ZydisBroadcastMode mode
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvxRounding_
         0 |   ZydisRoundingMode mode
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvxSwizzle_
         0 |   ZydisSwizzleMode mode
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvxConversion_
         0 |   ZydisConversionMode mode
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionAvx_
         0 |   ZyanU16 vector_length
         4 |   struct ZydisDecodedInstructionAvxMask_ mask
         4 |     ZydisMaskMode mode
         8 |     ZydisRegister reg
        12 |   struct ZydisDecodedInstructionAvxBroadcast_ broadcast
        12 |     ZyanBool is_static
        16 |     ZydisBroadcastMode mode
        20 |   struct ZydisDecodedInstructionAvxRounding_ rounding
        20 |     ZydisRoundingMode mode
        24 |   struct ZydisDecodedInstructionAvxSwizzle_ swizzle
        24 |     ZydisSwizzleMode mode
        28 |   struct ZydisDecodedInstructionAvxConversion_ conversion
        28 |     ZydisConversionMode mode
        32 |   ZyanBool has_sae
        33 |   ZyanBool has_eviction_hint
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionMeta_
         0 |   ZydisInstructionCategory category
         4 |   ZydisISASet isa_set
         8 |   ZydisISAExt isa_ext
        12 |   ZydisBranchType branch_type
        16 |   ZydisExceptionClass exception_class
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawPrefixes_
         0 |   ZydisPrefixType type
         4 |   ZyanU8 value
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | union ZydisDecodedInstructionRaw_::(unnamed at amalgamated-dist/Zydis.h:6217:5)
         0 |   struct ZydisDecodedInstructionRawRex_ rex
         0 |     ZyanU8 W
         1 |     ZyanU8 R
         2 |     ZyanU8 X
         3 |     ZyanU8 B
         4 |     ZyanU8 offset
         0 |   struct ZydisDecodedInstructionRawXop_ xop
         0 |     ZyanU8 R
         1 |     ZyanU8 X
         2 |     ZyanU8 B
         3 |     ZyanU8 m_mmmm
         4 |     ZyanU8 W
         5 |     ZyanU8 vvvv
         6 |     ZyanU8 L
         7 |     ZyanU8 pp
         8 |     ZyanU8 offset
         0 |   struct ZydisDecodedInstructionRawVex_ vex
         0 |     ZyanU8 R
         1 |     ZyanU8 X
         2 |     ZyanU8 B
         3 |     ZyanU8 m_mmmm
         4 |     ZyanU8 W
         5 |     ZyanU8 vvvv
         6 |     ZyanU8 L
         7 |     ZyanU8 pp
         8 |     ZyanU8 offset
         9 |     ZyanU8 size
         0 |   struct ZydisDecodedInstructionRawEvex evex
         0 |     ZyanU8 R
         1 |     ZyanU8 X
         2 |     ZyanU8 B
         3 |     ZyanU8 R2
         4 |     ZyanU8 mmm
         5 |     ZyanU8 W
         6 |     ZyanU8 vvvv
         7 |     ZyanU8 pp
         8 |     ZyanU8 z
         9 |     ZyanU8 L2
        10 |     ZyanU8 L
        11 |     ZyanU8 b
        12 |     ZyanU8 V2
        13 |     ZyanU8 aaa
        14 |     ZyanU8 offset
         0 |   struct ZydisDecodedInstructionRawMvex_ mvex
         0 |     ZyanU8 R
         1 |     ZyanU8 X
         2 |     ZyanU8 B
         3 |     ZyanU8 R2
         4 |     ZyanU8 mmmm
         5 |     ZyanU8 W
         6 |     ZyanU8 vvvv
         7 |     ZyanU8 pp
         8 |     ZyanU8 E
         9 |     ZyanU8 SSS
        10 |     ZyanU8 V2
        11 |     ZyanU8 kkk
        12 |     ZyanU8 offset
           | [sizeof=15, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionModRm_
         0 |   ZyanU8 mod
         1 |   ZyanU8 reg
         2 |   ZyanU8 rm
         3 |   ZyanU8 offset
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawSib_
         0 |   ZyanU8 scale
         1 |   ZyanU8 index
         2 |   ZyanU8 base
         3 |   ZyanU8 offset
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawDisp_
         0 |   ZyanI64 value
         8 |   ZyanU8 size
         9 |   ZyanU8 offset
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | union ZydisDecodedInstructionRawImmValue_
         0 |   ZyanU64 u
         0 |   ZyanI64 s
           | [sizeof=8, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRawImm_
         0 |   ZyanBool is_signed
         1 |   ZyanBool is_relative
         8 |   union ZydisDecodedInstructionRawImmValue_ value
         8 |     ZyanU64 u
         8 |     ZyanI64 s
        16 |   ZyanU8 size
        17 |   ZyanU8 offset
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstructionRaw_
         0 |   ZyanU8 prefix_count
         4 |   struct ZydisDecodedInstructionRawPrefixes_[15] prefixes
       124 |   ZydisInstructionEncoding encoding2
       128 |   union ZydisDecodedInstructionRaw_::(anonymous at amalgamated-dist/Zydis.h:6217:5) 
       128 |     struct ZydisDecodedInstructionRawRex_ rex
       128 |       ZyanU8 W
       129 |       ZyanU8 R
       130 |       ZyanU8 X
       131 |       ZyanU8 B
       132 |       ZyanU8 offset
       128 |     struct ZydisDecodedInstructionRawXop_ xop
       128 |       ZyanU8 R
       129 |       ZyanU8 X
       130 |       ZyanU8 B
       131 |       ZyanU8 m_mmmm
       132 |       ZyanU8 W
       133 |       ZyanU8 vvvv
       134 |       ZyanU8 L
       135 |       ZyanU8 pp
       136 |       ZyanU8 offset
       128 |     struct ZydisDecodedInstructionRawVex_ vex
       128 |       ZyanU8 R
       129 |       ZyanU8 X
       130 |       ZyanU8 B
       131 |       ZyanU8 m_mmmm
       132 |       ZyanU8 W
       133 |       ZyanU8 vvvv
       134 |       ZyanU8 L
       135 |       ZyanU8 pp
       136 |       ZyanU8 offset
       137 |       ZyanU8 size
       128 |     struct ZydisDecodedInstructionRawEvex evex
       128 |       ZyanU8 R
       129 |       ZyanU8 X
       130 |       ZyanU8 B
       131 |       ZyanU8 R2
       132 |       ZyanU8 mmm
       133 |       ZyanU8 W
       134 |       ZyanU8 vvvv
       135 |       ZyanU8 pp
       136 |       ZyanU8 z
       137 |       ZyanU8 L2
       138 |       ZyanU8 L
       139 |       ZyanU8 b
       140 |       ZyanU8 V2
       141 |       ZyanU8 aaa
       142 |       ZyanU8 offset
       128 |     struct ZydisDecodedInstructionRawMvex_ mvex
       128 |       ZyanU8 R
       129 |       ZyanU8 X
       130 |       ZyanU8 B
       131 |       ZyanU8 R2
       132 |       ZyanU8 mmmm
       133 |       ZyanU8 W
       134 |       ZyanU8 vvvv
       135 |       ZyanU8 pp
       136 |       ZyanU8 E
       137 |       ZyanU8 SSS
       138 |       ZyanU8 V2
       139 |       ZyanU8 kkk
       140 |       ZyanU8 offset
       143 |   struct ZydisDecodedInstructionModRm_ modrm
       143 |     ZyanU8 mod
       144 |     ZyanU8 reg
       145 |     ZyanU8 rm
       146 |     ZyanU8 offset
       147 |   struct ZydisDecodedInstructionRawSib_ sib
       147 |     ZyanU8 scale
       148 |     ZyanU8 index
       149 |     ZyanU8 base
       150 |     ZyanU8 offset
       152 |   struct ZydisDecodedInstructionRawDisp_ disp
       152 |     ZyanI64 value
       160 |     ZyanU8 size
       161 |     ZyanU8 offset
       168 |   struct ZydisDecodedInstructionRawImm_[2] imm
           | [sizeof=216, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecodedInstruction_
         0 |   ZydisMachineMode machine_mode
         4 |   ZydisMnemonic mnemonic
         8 |   ZyanU8 length
        12 |   ZydisInstructionEncoding encoding
        16 |   ZydisOpcodeMap opcode_map
        20 |   ZyanU8 opcode
        21 |   ZyanU8 stack_width
        22 |   ZyanU8 operand_width
        23 |   ZyanU8 address_width
        24 |   ZyanU8 operand_count
        25 |   ZyanU8 operand_count_visible
        32 |   ZydisInstructionAttributes attributes
        40 |   const ZydisAccessedFlags * cpu_flags
        48 |   const ZydisAccessedFlags * fpu_flags
        56 |   struct ZydisDecodedInstructionAvx_ avx
        56 |     ZyanU16 vector_length
        60 |     struct ZydisDecodedInstructionAvxMask_ mask
        60 |       ZydisMaskMode mode
        64 |       ZydisRegister reg
        68 |     struct ZydisDecodedInstructionAvxBroadcast_ broadcast
        68 |       ZyanBool is_static
        72 |       ZydisBroadcastMode mode
        76 |     struct ZydisDecodedInstructionAvxRounding_ rounding
        76 |       ZydisRoundingMode mode
        80 |     struct ZydisDecodedInstructionAvxSwizzle_ swizzle
        80 |       ZydisSwizzleMode mode
        84 |     struct ZydisDecodedInstructionAvxConversion_ conversion
        84 |       ZydisConversionMode mode
        88 |     ZyanBool has_sae
        89 |     ZyanBool has_eviction_hint
        92 |   struct ZydisDecodedInstructionMeta_ meta
        92 |     ZydisInstructionCategory category
        96 |     ZydisISASet isa_set
       100 |     ZydisISAExt isa_ext
       104 |     ZydisBranchType branch_type
       108 |     ZydisExceptionClass exception_class
       112 |   struct ZydisDecodedInstructionRaw_ raw
       112 |     ZyanU8 prefix_count
       116 |     struct ZydisDecodedInstructionRawPrefixes_[15] prefixes
       236 |     ZydisInstructionEncoding encoding2
       240 |     union ZydisDecodedInstructionRaw_::(anonymous at amalgamated-dist/Zydis.h:6217:5) 
       240 |       struct ZydisDecodedInstructionRawRex_ rex
       240 |         ZyanU8 W
       241 |         ZyanU8 R
       242 |         ZyanU8 X
       243 |         ZyanU8 B
       244 |         ZyanU8 offset
       240 |       struct ZydisDecodedInstructionRawXop_ xop
       240 |         ZyanU8 R
       241 |         ZyanU8 X
       242 |         ZyanU8 B
       243 |         ZyanU8 m_mmmm
       244 |         ZyanU8 W
       245 |         ZyanU8 vvvv
       246 |         ZyanU8 L
       247 |         ZyanU8 pp
       248 |         ZyanU8 offset
       240 |       struct ZydisDecodedInstructionRawVex_ vex
       240 |         ZyanU8 R
       241 |         ZyanU8 X
       242 |         ZyanU8 B
       243 |         ZyanU8 m_mmmm
       244 |         ZyanU8 W
       245 |         ZyanU8 vvvv
       246 |         ZyanU8 L
       247 |         ZyanU8 pp
       248 |         ZyanU8 offset
       249 |         ZyanU8 size
       240 |       struct ZydisDecodedInstructionRawEvex evex
       240 |         ZyanU8 R
       241 |         ZyanU8 X
       242 |         ZyanU8 B
       243 |         ZyanU8 R2
       244 |         ZyanU8 mmm
       245 |         ZyanU8 W
       246 |         ZyanU8 vvvv
       247 |         ZyanU8 pp
       248 |         ZyanU8 z
       249 |         ZyanU8 L2
       250 |         ZyanU8 L
       251 |         ZyanU8 b
       252 |         ZyanU8 V2
       253 |         ZyanU8 aaa
       254 |         ZyanU8 offset
       240 |       struct ZydisDecodedInstructionRawMvex_ mvex
       240 |         ZyanU8 R
       241 |         ZyanU8 X
       242 |         ZyanU8 B
       243 |         ZyanU8 R2
       244 |         ZyanU8 mmmm
       245 |         ZyanU8 W
       246 |         ZyanU8 vvvv
       247 |         ZyanU8 pp
       248 |         ZyanU8 E
       249 |         ZyanU8 SSS
       250 |         ZyanU8 V2
       251 |         ZyanU8 kkk
       252 |         ZyanU8 offset
       255 |     struct ZydisDecodedInstructionModRm_ modrm
       255 |       ZyanU8 mod
       256 |       ZyanU8 reg
       257 |       ZyanU8 rm
       258 |       ZyanU8 offset
       259 |     struct ZydisDecodedInstructionRawSib_ sib
       259 |       ZyanU8 scale
       260 |       ZyanU8 index
       261 |       ZyanU8 base
       262 |       ZyanU8 offset
       264 |     struct ZydisDecodedInstructionRawDisp_ disp
       264 |       ZyanI64 value
       272 |       ZyanU8 size
       273 |       ZyanU8 offset
       280 |     struct ZydisDecodedInstructionRawImm_[2] imm
           | [sizeof=328, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6451:5)
         0 |   ZyanU8 W
         1 |   ZyanU8 R
         2 |   ZyanU8 X
         3 |   ZyanU8 B
         4 |   ZyanU8 L
         5 |   ZyanU8 LL
         6 |   ZyanU8 R2
         7 |   ZyanU8 V2
         8 |   ZyanU8 vvvv
         9 |   ZyanU8 mask
           | [sizeof=10, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6467:5)
         0 |   ZyanBool is_mod_reg
         1 |   ZyanU8 id_reg
         2 |   ZyanU8 id_rm
         3 |   ZyanU8 id_ndsndd
         4 |   ZyanU8 id_base
         5 |   ZyanU8 id_index
           | [sizeof=6, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6504:5)
         0 |   ZyanU8 tuple_type
         1 |   ZyanU8 element_size
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6518:5)
         0 |   ZyanU8 functionality
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisDecoderContext_
         0 |   const void * definition
         8 |   ZyanU8 eosz_index
         9 |   ZyanU8 easz_index
        10 |   struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6451:5) vector_unified
        10 |     ZyanU8 W
        11 |     ZyanU8 R
        12 |     ZyanU8 X
        13 |     ZyanU8 B
        14 |     ZyanU8 L
        15 |     ZyanU8 LL
        16 |     ZyanU8 R2
        17 |     ZyanU8 V2
        18 |     ZyanU8 vvvv
        19 |     ZyanU8 mask
        20 |   struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6467:5) reg_info
        20 |     ZyanBool is_mod_reg
        21 |     ZyanU8 id_reg
        22 |     ZyanU8 id_rm
        23 |     ZyanU8 id_ndsndd
        24 |     ZyanU8 id_base
        25 |     ZyanU8 id_index
        26 |   struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6504:5) evex
        26 |     ZyanU8 tuple_type
        27 |     ZyanU8 element_size
        28 |   struct ZydisDecoderContext_::(unnamed at amalgamated-dist/Zydis.h:6518:5) mvex
        28 |     ZyanU8 functionality
        29 |   ZyanU8 cd8_scale
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisDecoder_
         0 |   ZydisMachineMode machine_mode
         4 |   ZydisStackWidth stack_width
         8 |   ZyanU32 decoder_mode
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderOperandReg_
         0 |   ZydisRegister value
         4 |   ZyanBool is4
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderOperandMem_
         0 |   ZydisRegister base
         4 |   ZydisRegister index
         8 |   ZyanU8 scale
        16 |   ZyanI64 displacement
        24 |   ZyanU16 size
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderOperandPtr_
         0 |   ZyanU16 segment
         4 |   ZyanU32 offset
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | union ZydisEncoderOperandImm_
         0 |   ZyanU64 u
         0 |   ZyanI64 s
           | [sizeof=8, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderOperand_
         0 |   ZydisOperandType type
         4 |   struct ZydisEncoderOperandReg_ reg
         4 |     ZydisRegister value
         8 |     ZyanBool is4
        16 |   struct ZydisEncoderOperandMem_ mem
        16 |     ZydisRegister base
        20 |     ZydisRegister index
        24 |     ZyanU8 scale
        32 |     ZyanI64 displacement
        40 |     ZyanU16 size
        48 |   struct ZydisEncoderOperandPtr_ ptr
        48 |     ZyanU16 segment
        52 |     ZyanU32 offset
        56 |   union ZydisEncoderOperandImm_ imm
        56 |     ZyanU64 u
        56 |     ZyanI64 s
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderRequestEvexFeatures_
         0 |   ZydisBroadcastMode broadcast
         4 |   ZydisRoundingMode rounding
         8 |   ZyanBool sae
         9 |   ZyanBool zeroing_mask
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderRequestMvexFeatures_
         0 |   ZydisBroadcastMode broadcast
         4 |   ZydisConversionMode conversion
         8 |   ZydisRoundingMode rounding
        12 |   ZydisSwizzleMode swizzle
        16 |   ZyanBool sae
        17 |   ZyanBool eviction_hint
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisEncoderRequest_
         0 |   ZydisMachineMode machine_mode
         4 |   ZydisEncodableEncoding allowed_encodings
         8 |   ZydisMnemonic mnemonic
        16 |   ZydisInstructionAttributes prefixes
        24 |   ZydisBranchType branch_type
        28 |   ZydisBranchWidth branch_width
        32 |   ZydisAddressSizeHint address_size_hint
        36 |   ZydisOperandSizeHint operand_size_hint
        40 |   ZyanU8 operand_count
        48 |   ZydisEncoderOperand[5] operands
       368 |   struct ZydisEncoderRequestEvexFeatures_ evex
       368 |     ZydisBroadcastMode broadcast
       372 |     ZydisRoundingMode rounding
       376 |     ZyanBool sae
       377 |     ZyanBool zeroing_mask
       380 |   struct ZydisEncoderRequestMvexFeatures_ mvex
       380 |     ZydisBroadcastMode broadcast
       384 |     ZydisConversionMode conversion
       388 |     ZydisRoundingMode rounding
       392 |     ZydisSwizzleMode swizzle
       396 |     ZyanBool sae
       397 |     ZyanBool eviction_hint
           | [sizeof=400, align=8]

*** Dumping AST Record Layout
         0 | struct ZyanAllocator_
         0 |   ZyanAllocatorAllocate allocate
         8 |   ZyanAllocatorAllocate reallocate
        16 |   ZyanAllocatorDeallocate deallocate
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct ZyanVector_
         0 |   ZyanAllocator * allocator
         8 |   ZyanU8 growth_factor
         9 |   ZyanU8 shrink_threshold
        16 |   ZyanUSize size
        24 |   ZyanUSize capacity
        32 |   ZyanUSize element_size
        40 |   ZyanMemberProcedure destructor
        48 |   void * data
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct ZyanString_
         0 |   ZyanStringFlags flags
         8 |   struct ZyanVector_ vector
         8 |     ZyanAllocator * allocator
        16 |     ZyanU8 growth_factor
        17 |     ZyanU8 shrink_threshold
        24 |     ZyanUSize size
        32 |     ZyanUSize capacity
        40 |     ZyanUSize element_size
        48 |     ZyanMemberProcedure destructor
        56 |     void * data
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct ZyanStringView_
         0 |   struct ZyanString_ string
         0 |     ZyanStringFlags flags
         8 |     struct ZyanVector_ vector
         8 |       ZyanAllocator * allocator
        16 |       ZyanU8 growth_factor
        17 |       ZyanU8 shrink_threshold
        24 |       ZyanUSize size
        32 |       ZyanUSize capacity
        40 |       ZyanUSize element_size
        48 |       ZyanMemberProcedure destructor
        56 |       void * data
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisFormatterToken_
         0 |   ZydisTokenType type
         1 |   ZyanU8 next
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | struct ZydisFormatterBuffer_
         0 |   ZyanBool is_token_list
         8 |   ZyanUSize capacity
        16 |   struct ZyanString_ string
        16 |     ZyanStringFlags flags
        24 |     struct ZyanVector_ vector
        24 |       ZyanAllocator * allocator
        32 |       ZyanU8 growth_factor
        33 |       ZyanU8 shrink_threshold
        40 |       ZyanUSize size
        48 |       ZyanUSize capacity
        56 |       ZyanUSize element_size
        64 |       ZyanMemberProcedure destructor
        72 |       void * data
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisFormatterContext_
         0 |   const ZydisDecodedInstruction * instruction
         8 |   const ZydisDecodedOperand * operands
        16 |   const ZydisDecodedOperand * operand
        24 |   ZyanU64 runtime_address
        32 |   void * user_data
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisFormatter_::(unnamed at amalgamated-dist/Zydis.h:11276:5)
         0 |   const ZyanStringView * string
         8 |   struct ZyanStringView_ string_data
         8 |     struct ZyanString_ string
         8 |       ZyanStringFlags flags
        16 |       struct ZyanVector_ vector
        16 |         ZyanAllocator * allocator
        24 |         ZyanU8 growth_factor
        25 |         ZyanU8 shrink_threshold
        32 |         ZyanUSize size
        40 |         ZyanUSize capacity
        48 |         ZyanUSize element_size
        56 |         ZyanMemberProcedure destructor
        64 |         void * data
        72 |   char[11] buffer
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisFormatter_
         0 |   ZydisFormatterStyle style
         4 |   ZyanBool force_memory_size
         5 |   ZyanBool force_memory_segment
         6 |   ZyanBool force_memory_scale
         7 |   ZyanBool force_relative_branches
         8 |   ZyanBool force_relative_riprel
         9 |   ZyanBool print_branch_size
        10 |   ZyanBool detailed_prefixes
        12 |   ZydisNumericBase addr_base
        16 |   ZydisSignedness addr_signedness
        20 |   ZydisPadding addr_padding_absolute
        24 |   ZydisPadding addr_padding_relative
        28 |   ZydisNumericBase disp_base
        32 |   ZydisSignedness disp_signedness
        36 |   ZydisPadding disp_padding
        40 |   ZydisNumericBase imm_base
        44 |   ZydisSignedness imm_signedness
        48 |   ZydisPadding imm_padding
        52 |   ZyanI32 case_prefixes
        56 |   ZyanI32 case_mnemonic
        60 |   ZyanI32 case_registers
        64 |   ZyanI32 case_typecasts
        68 |   ZyanI32 case_decorators
        72 |   ZyanBool hex_uppercase
        73 |   ZyanBool hex_force_leading_number
        80 |   struct (unnamed struct at amalgamated-dist/Zydis.h:11276:5)[2][2] number_format
       432 |   ZydisFormatterFunc func_pre_instruction
       440 |   ZydisFormatterFunc func_post_instruction
       448 |   ZydisFormatterFunc func_format_instruction
       456 |   ZydisFormatterFunc func_pre_operand
       464 |   ZydisFormatterFunc func_post_operand
       472 |   ZydisFormatterFunc func_format_operand_reg
       480 |   ZydisFormatterFunc func_format_operand_mem
       488 |   ZydisFormatterFunc func_format_operand_ptr
       496 |   ZydisFormatterFunc func_format_operand_imm
       504 |   ZydisFormatterFunc func_print_mnemonic
       512 |   ZydisFormatterRegisterFunc func_print_register
       520 |   ZydisFormatterFunc func_print_address_abs
       528 |   ZydisFormatterFunc func_print_address_rel
       536 |   ZydisFormatterFunc func_print_disp
       544 |   ZydisFormatterFunc func_print_imm
       552 |   ZydisFormatterFunc func_print_typecast
       560 |   ZydisFormatterFunc func_print_segment
       568 |   ZydisFormatterFunc func_print_prefixes
       576 |   ZydisFormatterDecoratorFunc func_print_decorator
           | [sizeof=584, align=8]

*** Dumping AST Record Layout
         0 | struct ZydisInstructionSegments_::(unnamed at amalgamated-dist/Zydis.h:11687:5)
         0 |   ZydisInstructionSegment type
         4 |   ZyanU8 offset
         5 |   ZyanU8 size
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisInstructionSegments_
         0 |   ZyanU8 count
         4 |   struct (unnamed struct at amalgamated-dist/Zydis.h:11687:5)[9] segments
           | [sizeof=76, align=4]

*** Dumping AST Record Layout
         0 | struct ZydisDisassembledInstruction_
         0 |   ZyanU64 runtime_address
         8 |   struct ZydisDecodedInstruction_ info
         8 |     ZydisMachineMode machine_mode
        12 |     ZydisMnemonic mnemonic
        16 |     ZyanU8 length
        20 |     ZydisInstructionEncoding encoding
        24 |     ZydisOpcodeMap opcode_map
        28 |     ZyanU8 opcode
        29 |     ZyanU8 stack_width
        30 |     ZyanU8 operand_width
        31 |     ZyanU8 address_width
        32 |     ZyanU8 operand_count
        33 |     ZyanU8 operand_count_visible
        40 |     ZydisInstructionAttributes attributes
        48 |     const ZydisAccessedFlags * cpu_flags
        56 |     const ZydisAccessedFlags * fpu_flags
        64 |     struct ZydisDecodedInstructionAvx_ avx
        64 |       ZyanU16 vector_length
        68 |       struct ZydisDecodedInstructionAvxMask_ mask
        68 |         ZydisMaskMode mode
        72 |         ZydisRegister reg
        76 |       struct ZydisDecodedInstructionAvxBroadcast_ broadcast
        76 |         ZyanBool is_static
        80 |         ZydisBroadcastMode mode
        84 |       struct ZydisDecodedInstructionAvxRounding_ rounding
        84 |         ZydisRoundingMode mode
        88 |       struct ZydisDecodedInstructionAvxSwizzle_ swizzle
        88 |         ZydisSwizzleMode mode
        92 |       struct ZydisDecodedInstructionAvxConversion_ conversion
        92 |         ZydisConversionMode mode
        96 |       ZyanBool has_sae
        97 |       ZyanBool has_eviction_hint
       100 |     struct ZydisDecodedInstructionMeta_ meta
       100 |       ZydisInstructionCategory category
       104 |       ZydisISASet isa_set
       108 |       ZydisISAExt isa_ext
       112 |       ZydisBranchType branch_type
       116 |       ZydisExceptionClass exception_class
       120 |     struct ZydisDecodedInstructionRaw_ raw
       120 |       ZyanU8 prefix_count
       124 |       struct ZydisDecodedInstructionRawPrefixes_[15] prefixes
       244 |       ZydisInstructionEncoding encoding2
       248 |       union ZydisDecodedInstructionRaw_::(anonymous at amalgamated-dist/Zydis.h:6217:5) 
       248 |         struct ZydisDecodedInstructionRawRex_ rex
       248 |           ZyanU8 W
       249 |           ZyanU8 R
       250 |           ZyanU8 X
       251 |           ZyanU8 B
       252 |           ZyanU8 offset
       248 |         struct ZydisDecodedInstructionRawXop_ xop
       248 |           ZyanU8 R
       249 |           ZyanU8 X
       250 |           ZyanU8 B
       251 |           ZyanU8 m_mmmm
       252 |           ZyanU8 W
       253 |           ZyanU8 vvvv
       254 |           ZyanU8 L
       255 |           ZyanU8 pp
       256 |           ZyanU8 offset
       248 |         struct ZydisDecodedInstructionRawVex_ vex
       248 |           ZyanU8 R
       249 |           ZyanU8 X
       250 |           ZyanU8 B
       251 |           ZyanU8 m_mmmm
       252 |           ZyanU8 W
       253 |           ZyanU8 vvvv
       254 |           ZyanU8 L
       255 |           ZyanU8 pp
       256 |           ZyanU8 offset
       257 |           ZyanU8 size
       248 |         struct ZydisDecodedInstructionRawEvex evex
       248 |           ZyanU8 R
       249 |           ZyanU8 X
       250 |           ZyanU8 B
       251 |           ZyanU8 R2
       252 |           ZyanU8 mmm
       253 |           ZyanU8 W
       254 |           ZyanU8 vvvv
       255 |           ZyanU8 pp
       256 |           ZyanU8 z
       257 |           ZyanU8 L2
       258 |           ZyanU8 L
       259 |           ZyanU8 b
       260 |           ZyanU8 V2
       261 |           ZyanU8 aaa
       262 |           ZyanU8 offset
       248 |         struct ZydisDecodedInstructionRawMvex_ mvex
       248 |           ZyanU8 R
       249 |           ZyanU8 X
       250 |           ZyanU8 B
       251 |           ZyanU8 R2
       252 |           ZyanU8 mmmm
       253 |           ZyanU8 W
       254 |           ZyanU8 vvvv
       255 |           ZyanU8 pp
       256 |           ZyanU8 E
       257 |           ZyanU8 SSS
       258 |           ZyanU8 V2
       259 |           ZyanU8 kkk
       260 |           ZyanU8 offset
       263 |       struct ZydisDecodedInstructionModRm_ modrm
       263 |         ZyanU8 mod
       264 |         ZyanU8 reg
       265 |         ZyanU8 rm
       266 |         ZyanU8 offset
       267 |       struct ZydisDecodedInstructionRawSib_ sib
       267 |         ZyanU8 scale
       268 |         ZyanU8 index
       269 |         ZyanU8 base
       270 |         ZyanU8 offset
       272 |       struct ZydisDecodedInstructionRawDisp_ disp
       272 |         ZyanI64 value
       280 |         ZyanU8 size
       281 |         ZyanU8 offset
       288 |       struct ZydisDecodedInstructionRawImm_[2] imm
       336 |   ZydisDecodedOperand[10] operands
      1136 |   char[96] text
           | [sizeof=1232, align=8]


